sulaolab/sonora-ak-nano/src/app/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ak.c
// Silicon-layer SPI register/DMA ops (tdm_spi_apply_config, *_dma_trigger_enable,
// *_module_enable, *_irq_*, *_soft_stop, *_dma_config) now live in the hw module and
// are reached as nora_spi_i2s_tdm_hw_*() taking a tdm_spi_inst_t + raw fields.

// Per-instance teardown/clear helpers (one physical SPI's own DMA buffers/channels).
static void        tdm_inst_clear_buffers( const tdm_spi_leg_t *leg );
static void        tdm_inst_soft_stop_dma( const tdm_spi_leg_t *leg );
static void        tdm_inst_clear_dma_flags( const tdm_spi_leg_t *leg );
static void        tdm_zero_memory(void *ptr, size_t bytes);
static bool        tdm_spi_leg_is_valid( const tdm_spi_leg_t *leg );
static bool        tdm_stream_topology_is_valid( const tdm_stream_t *stream );
static const tdm_spi_leg_t *tdm_stream_primary_leg( const tdm_stream_t *stream );
static bool        tdm_spi_leg_get_effective_config( const tdm_spi_leg_t *leg,
                                                     nora_spi_i2s_tdm_config_t *effective_cfg );

// Config-mode + lifecycle helpers (definitions below). tdm_inst_stop_impl is the
// mode-agnostic per-leg teardown that both the public inst_stop() gate and the SYSTEM
// domain teardown (stop_domain/stop_all_domains) call; tdm_stream_ready_for_start()
// re-checks the clock-readiness gate just before a start; tdm_any_leg_running() /
// tdm_inst_is_primary() back the lifecycle gates.
static void        tdm_inst_stop_impl( tdm_spi_leg_t *inst );
static bool        tdm_stream_ready_for_start( void );
static bool        tdm_any_leg_running( void );
static bool        tdm_inst_is_primary( const tdm_spi_leg_t *inst );
// tdm_set_error() is defined further down (static inline); forward-declare it because the
// lifecycle setters above its definition (set_port/close) now record an error code.
static inline void tdm_set_error( nora_spi_i2s_tdm_error_t err );

// RX-DMA IE bracket, config-envelope validation, and the per-instance RX-block ISR
// body. Definitions live in the Local Function section; forward-declared here so the
// global readers (get_load/get_status) and the ISR wrappers above their definitions
// resolve them. tdm_rx_ie_*/tdm_rx_block are static inline (folded in the hot path).
//
// always_inline on tdm_rx_block is load-bearing, not decoration. `static inline` is only
// a request: this function sits just under XC-DSC's inline-cost threshold, and the nora_
// rename pushed it over -- the compiler then emitted ONE shared out-of-line body and turned
// every RX vector into a 6-instruction thunk that calls it. Measured against main at the
// same configuration and preset: __DMA0Interrupt/__DMA2Interrupt 637 -> 6 instructions with
// a shared 859-instruction _tdm_rx_block. That silently retracts the guarantee the vector
// comments below rely on (literal channel numbers and half size folding into the register
// access, no runtime channel->leg lookup) and adds call overhead to an ISR that already
// runs at 76.6% at 48k and 90.0% at 8k. The attribute costs ~1.1 KB of flash to duplicate
// the body per vector; that is the price of the folding, and it is worth paying here.
// tools/asrc/hotpath_invariance.py is what catches a regression of this shape -- run it
// against a main-side baseline, not against a checked-in one.
static inline bool tdm_rx_ie_disable( uint8_t rx_dma_ch );
static inline void tdm_rx_ie_restore( uint8_t rx_dma_ch, bool was_enabled );
static bool        tdm_config_is_supported( const tdm_spi_leg_t* leg, const nora_spi_i2s_tdm_config_t* cfg );
static inline __attribute__((always_inline)) void tdm_rx_block(
    tdm_spi_leg_t* inst, uint8_t rx_ch, uint8_t tx_ch, uint32_t half_pos );




static inline void  tdm_get_src_ptr( uint32_t        dma_stat,
                                       const int32_t*  const pRxDat,
                                       uint32_t        half_pos,
                                       const int32_t** src_pptr );
static inline void  tdm_get_dest_ptr( uint32_t dma_tx_addr, int32_t* const pTxDat, uint32_t half_pos, int32_t** dest_pptr );





//===========================================================
// Variables
//===========================================================

#define DMA_BUF_PING_POS     (0)   // ping half is always at offset 0; pong half = slots*blk per leg

// Per-instance ping/pong half size (words) = slots * blk for THIS row. Both the buffer
// size (2 * half) and the ISR's pong-half offset derive from it; passed as a compile-
// time literal into the explicit per-leg ISR bodies so the hot-path pointer math stays folded.
#define TDM_LEG_HALF_WORDS(slots, blk)   ((slots) * (blk))

// Explicit per-leg RX/TX ping-pong buffers. Each is 2*slots*blk words (Ping+Pong). The macro takes
// per-leg slots/blk so a future build COULD give a leg its own geometry, but this build sizes every
// leg from the single global NORA_TDM_SLOTS_PER_FS / _BLOCK_FRAMES. The names follow the leg
// names so the leg table can wire them; same geometry macros as the leg table + ISR so the three
// stay consistent.
// Keep each complete ping-pong array on its own-size boundary. Besides making the DMA base
// deterministic as unrelated BSS grows, this prevents one transfer array from straddling a
// data-RAM bank boundary (observed when the bidirectional ASRC state grew from 8ch to 16ch).
#define TDM_DMA_BUFFER_BYTES \
    (2u * TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) * sizeof(int32_t))
#define TDM_DMA_BUFFER_ALIGN  (TDM_DMA_BUFFER_BYTES)
/* aligned(N) requires a power of two.  Derive N from the selected app's geometry
 * instead of embedding the ASRC TDM8 x 16-frame size (1024 bytes) in the HAL. */
TDM_COMPILEASSERT( TDM_DMA_BUFFER_BYTES > 0u );
TDM_COMPILEASSERT( (TDM_DMA_BUFFER_BYTES & (TDM_DMA_BUFFER_BYTES - 1u)) == 0u );
static int32_t    Tx_SPI1[ 2 * TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) ] __attribute__((aligned(TDM_DMA_BUFFER_ALIGN)));
static int32_t    Rx_SPI1[ 2 * TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) ] __attribute__((aligned(TDM_DMA_BUFFER_ALIGN)));
#if NORA_TDM_USE_SPI2
static int32_t    Tx_SPI2[ 2 * TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) ] __attribute__((aligned(TDM_DMA_BUFFER_ALIGN)));
static int32_t    Rx_SPI2[ 2 * TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) ] __attribute__((aligned(TDM_DMA_BUFFER_ALIGN)));
#endif
#if NORA_TDM_USE_SPI3
static int32_t    Tx_SPI3[ 2 * TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) ] __attribute__((aligned(TDM_DMA_BUFFER_ALIGN)));
static int32_t    Rx_SPI3[ 2 * TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) ] __attribute__((aligned(TDM_DMA_BUFFER_ALIGN)));
#endif
#if NORA_TDM_USE_SPI4
static int32_t    Tx_SPI4[ 2 * TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) ] __attribute__((aligned(TDM_DMA_BUFFER_ALIGN)));
static int32_t    Rx_SPI4[ 2 * TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) ] __attribute__((aligned(TDM_DMA_BUFFER_ALIGN)));
#endif

// Application processing buffers are outside the HAL's ownership. The HAL core owns and clears
// only its RX/TX DMA ping-pong buffers (the Rx_<name>/Tx_<name> pair per leg above).


//===========================================================
// DMA channel + SPI allocation
//
// The DEVICE FACTS table (s_spi_dev[]: SPIxBUF/CON1/BRG/IMSK + DMA trigger CHSELs +
// CPU IRQ bits, indexed by tdm_spi_inst_t) lives in the silicon layer
// (nora_spi_i2s_tdm_dspic33ak_hw.*). Here the transport core keeps only its DRIVER
// ALLOCATION: s_spi_legs[], one physical SPI leg per row with the SPI instance, RX/TX
// DMA channels, owned ping-pong buffers, and current logical config. start() passes
// each leg's spi_inst + DMA channels/buffers down to the hw_* ops.
//===========================================================

// One row per physical SPI leg: physical SPI + RX/TX DMA channels + its own
// Rx_<name>/Tx_<name> ping-pong buffers. Each leg's CLOCK role is NOT forced here -- it
// comes from the leg's own config (set by the integrator per leg: a co-clocked follower is
// configured SLAVE because it rides the shared clock, not because the HAL forces it). The
// singleton-reporting leg is the stream's primary_leg_index, not a per-row flag.
static tdm_spi_leg_t s_spi_legs[] =
{
    [TDM_SPI_LEG_SPI1] =
    {
#if NORA_TDM_BASE_ON_SPI34
        .spi_inst               = TDM_SPI3,
        .rx_dma_ch              = NORA_TDM_SPI3_RX_DMA,
        .tx_dma_ch              = NORA_TDM_SPI3_TX_DMA,
#else
        .spi_inst               = TDM_SPI1,
        .rx_dma_ch              = NORA_TDM_SPI1_RX_DMA,
        .tx_dma_ch              = NORA_TDM_SPI1_TX_DMA,
#endif
        .rx_buffer              = Rx_SPI1,
        .tx_buffer              = Tx_SPI1,
        .buffer_word_count      = TDM_ARRAY_SIZE(Rx_SPI1),
        .geom_slots_per_fs      = (uint8_t)(NORA_TDM_SLOTS_PER_FS),
        .geom_block_frames      = (uint16_t)(NORA_TDM_BLOCK_FRAMES),
        .sync_domain            = (uint8_t)(NORA_TDM_SPI1_SYNC_DOMAIN),
        .irq_priority           = (uint8_t)(PRIO_TDM_DMA),
        .prof_owner             = (uint8_t)(NORA_CPU_LOAD_OWNER_LEG_A),
        .block_cb               = NULL,
        .block_user             = NULL,
        .diag                   = { .isr_min_count = 0xFFFFFFFFUL },  /* rest zero; start() calls diag_reset() */
    },
#if NORA_TDM_USE_SPI2
    [TDM_SPI_LEG_SPI2] =
    {
#if NORA_TDM_BASE_ON_SPI34
        .spi_inst               = TDM_SPI4,
        .rx_dma_ch              = NORA_TDM_SPI4_RX_DMA,
        .tx_dma_ch              = NORA_TDM_SPI4_TX_DMA,
#else
        .spi_inst               = TDM_SPI2,
        .rx_dma_ch              = NORA_TDM_SPI2_RX_DMA,
        .tx_dma_ch              = NORA_TDM_SPI2_TX_DMA,
#endif
        .rx_buffer              = Rx_SPI2,
        .tx_buffer              = Tx_SPI2,
        .buffer_word_count      = TDM_ARRAY_SIZE(Rx_SPI2),
        .geom_slots_per_fs      = (uint8_t)(NORA_TDM_SLOTS_PER_FS),
        .geom_block_frames      = (uint16_t)(NORA_TDM_BLOCK_FRAMES),
        .sync_domain            = (uint8_t)(NORA_TDM_SPI2_SYNC_DOMAIN),
        .irq_priority           = (uint8_t)(PRIO_TDM_DMA),
        .prof_owner             = (uint8_t)(NORA_CPU_LOAD_OWNER_LEG_B),
        .block_cb               = NULL,
        .block_user             = NULL,
        .diag                   = { .isr_min_count = 0xFFFFFFFFUL },
    },
#endif // NORA_TDM_USE_SPI2
#if NORA_TDM_USE_SPI3
    [TDM_SPI_LEG_SPI3] =
    {
        .spi_inst               = TDM_SPI3,
        .rx_dma_ch              = NORA_TDM_SPI3_RX_DMA,
        .tx_dma_ch              = NORA_TDM_SPI3_TX_DMA,
        .rx_buffer              = Rx_SPI3,
        .tx_buffer              = Tx_SPI3,
        .buffer_word_count      = TDM_ARRAY_SIZE(Rx_SPI3),
        .geom_slots_per_fs      = (uint8_t)(NORA_TDM_SLOTS_PER_FS),
        .geom_block_frames      = (uint16_t)(NORA_TDM_BLOCK_FRAMES),
        .sync_domain            = (uint8_t)(NORA_TDM_SPI3_SYNC_DOMAIN),
        .irq_priority           = (uint8_t)(PRIO_TDM_DMA),
        .prof_owner             = (uint8_t)(NORA_CPU_LOAD_OWNER_OTHER),
        .block_cb               = NULL,
        .block_user             = NULL,
        .diag                   = { .isr_min_count = 0xFFFFFFFFUL },
    },
#endif // NORA_TDM_USE_SPI3
#if NORA_TDM_USE_SPI4
    [TDM_SPI_LEG_SPI4] =
    {
        .spi_inst               = TDM_SPI4,
        .rx_dma_ch              = NORA_TDM_SPI4_RX_DMA,
        .tx_dma_ch              = NORA_TDM_SPI4_TX_DMA,
        .rx_buffer              = Rx_SPI4,
        .tx_buffer              = Tx_SPI4,
        .buffer_word_count      = TDM_ARRAY_SIZE(Rx_SPI4),
        .geom_slots_per_fs      = (uint8_t)(NORA_TDM_SLOTS_PER_FS),
        .geom_block_frames      = (uint16_t)(NORA_TDM_BLOCK_FRAMES),
        .sync_domain            = (uint8_t)(NORA_TDM_SPI4_SYNC_DOMAIN),
        .irq_priority           = (uint8_t)(PRIO_TDM_DMA),
        .prof_owner             = (uint8_t)(NORA_CPU_LOAD_OWNER_OTHER),
        .block_cb               = NULL,
        .block_user             = NULL,
        .diag                   = { .isr_min_count = 0xFFFFFFFFUL },
    },
#endif // NORA_TDM_USE_SPI4
};

static tdm_stream_t s_stream =
{
    .legs              = s_spi_legs,
    .leg_count         = (uint8_t)TDM_ARRAY_SIZE(s_spi_legs),
    .primary_leg_index = (uint8_t)TDM_SPI_LEG_SPI1,   // logical leg 0 = co-clock anchor / singleton-reporting leg
    .opened            = false,
    .port              = NULL,
};

// Configuration OWNERSHIP mode: how the currently-committed config was applied, which
// selects the mutually-exclusive API surface. It is a property of the committed
// CONFIGURATION, NOT the open/close lifecycle -- close() does NOT reset it (a closed
// stream keeps its committed shape so the next open()->start uses the same API family).
//   NONE   : nothing configured yet.
//   SINGLE : committed via inst_configure() -> the per-leg PRIMARY-only API
//            (inst_configure / inst_start / inst_stop) is in force.
//   SYSTEM : committed via configure_system() -> the whole-system domain API
//            (configure_system / start_domain / start_all_domains / stop_domain /
//            stop_all_domains) is in force.
// configure_system() may full-recommit from ANY mode (NONE/SINGLE/SYSTEM) while CLOSED (before
// open(); an already-open engine is rejected with ERR_ALREADY_OPEN, so recommit implies stopped);
// once SYSTEM, inst_configure() is rejected (a system caller must stay transactional).
typedef enum {
    TDM_CONFIG_MODE_NONE = 0,
    TDM_CONFIG_MODE_SINGLE,
    TDM_CONFIG_MODE_SYSTEM,
} tdm_config_mode_t;

static tdm_config_mode_t s_config_mode = TDM_CONFIG_MODE_NONE;

