sulaolab/sonora-ak-nano/src/app/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ak.c
// Is this leg the stream's PRIMARY leg (the only leg the SINGLE per-leg API may touch)?
static bool tdm_inst_is_primary( const tdm_spi_leg_t *inst )
{
    return ( inst != NULL ) && ( inst == tdm_stream_primary_leg( &s_stream ) );
}

// Any leg currently running? Backs the close()/set_port() "not while streaming" guards.
static bool tdm_any_leg_running( void )
{
    const uint8_t n = s_stream.leg_count;
    for( uint8_t i = 0u; i < n; i++ )
    {
        const tdm_spi_leg_t *leg = &s_stream.legs[i];
        if( leg->running )
        {
            return true;
        }
    }
    return false;
}

// The registered board/clock port is owned by the singleton stream context.
// The table is held by pointer, not copied, so the caller must provide a
// static/long-lived object. NULL is the board-free default: no pin routing,
// no external clock gate, and no clock-change events.

// Block-completion callback ownership lives PER INSTANCE (tdm_spi_leg_t.block_cb).
// Each instance's RX-block ISR invokes its own callback for each completed block;
// if NULL, that instance runs no app/DSP path and start()'s zeroed TX half stays
// silent until a callback fills it. Register before start(), do not clear while
// running; set_block_callback() updates the pair under that instance's RX DMA IE mask.

// Stream-health counters and the ISR load/time monitor live in the separated
// diagnostics module (nora_spi_i2s_tdm_diag.*); each instance (tdm_spi_leg_t)
// holds its own nora_spi_i2s_tdm_diag_t and updates it ONLY through the diag_*
// functions. Each instance's RX-block ISR feeds its diag (note_block / check_deadline
// / isr_begin / isr_end); start() resets every instance's diag. The singleton
// get_load()/get_status() report the primary leg's diag under its RX DMA IE mask because
// 32-bit reads are non-atomic on this 16-bit core. The deadline metric is
// software/real-time, not SPIROV/SPITUR hardware status.

// Lifecycle running state is owned PER INSTANCE (tdm_spi_leg_t.running): set by a
// successful inst_start() and cleared by inst_stop(), exposed via
// inst_get_status().running and (for the primary leg) is_running(). This is
// deliberately separate from is_active(), which reports clock/source readiness.

// The leg table must have at least one leg and not exceed the silicon SPI count.
TDM_COMPILEASSERT( TDM_ARRAY_SIZE(s_spi_legs) >= 1u );
TDM_COMPILEASSERT( TDM_ARRAY_SIZE(s_spi_legs) <= (size_t)TDM_SPI_INST_COUNT );

// Per-instance geometry sanity (compile-time), one set per leg: slots/blk
// fit their leg fields (uint8_t / uint16_t), the 2*slots*blk word count cannot overflow
// int32 indexing, and the generated buffer is exactly that size. The Sonora rows use the
// stream-wide macros (already range-checked in conf.h); these guard a standalone carve-out
// that gives a row its own slots/blk -- so the per-instance-geometry promise has teeth.
TDM_COMPILEASSERT( (NORA_TDM_SLOTS_PER_FS) > 0 && (NORA_TDM_SLOTS_PER_FS) <= 255 );
TDM_COMPILEASSERT( (NORA_TDM_BLOCK_FRAMES) > 0 && (NORA_TDM_BLOCK_FRAMES) <= 65535 );
TDM_COMPILEASSERT( (NORA_TDM_SLOTS_PER_FS) <= (2147483647 / (2 * (NORA_TDM_BLOCK_FRAMES))) );
TDM_COMPILEASSERT( TDM_ARRAY_SIZE(Rx_SPI1) == (2u * (NORA_TDM_SLOTS_PER_FS) * (NORA_TDM_BLOCK_FRAMES)) );
#if NORA_TDM_USE_SPI2
TDM_COMPILEASSERT( TDM_ARRAY_SIZE(Rx_SPI2) == (2u * (NORA_TDM_SLOTS_PER_FS) * (NORA_TDM_BLOCK_FRAMES)) );
#endif
#if NORA_TDM_USE_SPI3
TDM_COMPILEASSERT( TDM_ARRAY_SIZE(Rx_SPI3) == (2u * (NORA_TDM_SLOTS_PER_FS) * (NORA_TDM_BLOCK_FRAMES)) );
#endif
#if NORA_TDM_USE_SPI4
TDM_COMPILEASSERT( TDM_ARRAY_SIZE(Rx_SPI4) == (2u * (NORA_TDM_SLOTS_PER_FS) * (NORA_TDM_BLOCK_FRAMES)) );
#endif




//===========================================================
// Global Function
//===========================================================

// DMA global init/validate were removed in favor of the low-level DMA HAL.
// main() calls nora_dma_global_init() once at startup; the per-channel
// config below checks nora_dma_channel_config()/_enable() return values.


/*
 * Register the board/clock adapter used by this HAL.
 *
 * The table is stored by pointer, not copied, so the caller must provide a
 * static/long-lived object. Passing NULL returns the HAL to its board-free
 * default: no pin routing, no clock gate, and no clock-change events.
 *
 * Rejected (false, port unchanged) while the port is already open()'d or any leg is
 * running: open() consumes the port hooks (clock/pins/CLC), so swapping the port after
 * open -- or under a live stream -- would leave the routed hardware disagreeing with the
 * registered hooks. Call it before open() (typically once at init).
 */
bool nora_spi_i2s_tdm_set_port( const nora_spi_i2s_tdm_port_t* port )
{
    if( s_stream.opened || tdm_any_leg_running() )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_ALREADY_OPEN );
        return false;
    }
    s_stream.port = port;
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * Report whether the external stream source is ready.
 *
 * This is a readiness gate, not a running-state check. With a registered port it
 * asks clock_source_ready(role); without a port it returns true so the HAL can
 * run as a self-clocked/no-gate transport.
 */
bool nora_spi_i2s_tdm_is_active( void )
{
    const tdm_stream_t *stream = &s_stream;

    // Stream-readiness gate routed through the clock port. No port (or no
    // clock_source_ready hook) => always ready (self-clocked, no external gate).
    // The Sonora platform wires this to the board's USB-audio clock readiness.
    // Pass the configured role. Before the first configure(), treat the transport
    // explicitly as SLAVE instead of relying on enum zero-initialization.
    if( ( stream->port != NULL ) && ( stream->port->clock_source_ready != NULL ) )
    {
        const tdm_spi_leg_t *primary = tdm_stream_primary_leg( stream );
        nora_spi_i2s_tdm_clock_role_t role =
            ( ( primary != NULL ) && primary->config_valid ) ? primary->config.clock_role
                                                             : NORA_SPI_I2S_TDM_CLOCK_SLAVE;
        return stream->port->clock_source_ready( role );
    }
    return true;
}


