sulaolab/sonora-ak-nano/src/app/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ak.c
/*
 * Re-check the clock-readiness gate immediately before a start (arm).
 *
 * open() checks readiness ONCE; between open() and start() an external BCLK/FS could drop.
 * The start paths (inst_start / start_domain / start_all_domains) call this just before
 * arming so a stream is not entered with the source already gone. Same gate as is_active()
 * / open(): keyed on the PRIMARY leg's role and routed through the port. A self-clocked
 * master (no port, or no clock_source_ready hook) is always ready. Returns true = go.
 *
 * READINESS SCOPE (by design): this gate is ENGINE-WIDE and PRIMARY-leg-gated -- it asks the
 * port about the primary leg's clock role, NOT per-domain. A sync_domain separates only the
 * START PHASE (which legs latch one FS edge together) and the clock topology (who is master);
 * it does NOT carry its own source-readiness. So even a nominally "independent" master domain
 * (e.g. an ASRC SPI2 on sync_domain 1) is gated on the primary leg's readiness here: if the
 * primary's external clock is not ready, start_domain() on any domain returns CLOCK_NOT_READY.
 * That matches the Sonora product policy ("no A clock -> hold the whole transport"). Per-domain
 * source readiness is intentionally NOT supported; revisit (a per-domain readiness hook) before
 * relying on truly independent async domains in a generic standalone reuse.
 */
static bool tdm_stream_ready_for_start( void )
{
    return nora_spi_i2s_tdm_is_active();
}


/*
 * Report the engine's running state = the PRIMARY leg (primary_leg_index, default logical leg 0).
 *
 * Set by a successful inst_start() of the primary leg and cleared by its inst_stop(). It
 * is separate from is_active(), which only means the clock/source gate is ready. For
 * a specific instance use inst_get_status().running.
 */
bool nora_spi_i2s_tdm_is_running( void )
{
    const tdm_spi_leg_t *primary = tdm_stream_primary_leg( &s_stream );
    return ( primary != NULL ) && primary->running;
}


/*
 * Read and clear the next external-clock stop/resume event.
 *
 * Clock detection lives in the board adapter and is reached through the port
 * hook. The app consumes this edge to run a mute-bounded stop/reconfigure/restart
 * sequence; without a hook, the HAL reports NONE.
 */
nora_spi_i2s_tdm_clock_event_t nora_spi_i2s_tdm_consume_clock_event( void )
{
    const tdm_stream_t *stream = &s_stream;

    // Routed through the clock port. No port (or no hook) => NONE (no external
    // clock to detect). A board port typically wires this to an external-clock edge detector.
    if( ( stream->port != NULL ) && ( stream->port->consume_clock_event != NULL ) )
    {
        return stream->port->consume_clock_event();
    }
    return NORA_SPI_I2S_TDM_CLOCK_EVENT_NONE;
}


// The transport is RATE-AGNOSTIC: it moves 32-bit words at whatever BCLK/FS the
// configured BRG (master) or the external clock (slave) provides, and never derives
// anything from a sample-rate value. So the old rate API
// (is_supported_sample_rate / notify_sample_rate / get_sample_rate /
// set_rate_callback + the rate_state machine + rate-change callback) has been removed.
// Sample-rate POLICY is not a HAL property at all -- the supported-rate set is the
// product/board's (APP_SAMPLE_RATE_IS_SUPPORTED in the app layer, used by the CMSIS-SAI
// wrapper to validate ARM_SAI AUDIO_FREQ). Any runtime rate DETECTION (e.g. from a
// USB-audio clock notification or an FS measurement) and the stop->reconfigure->start
// it would drive belong in the application, not here.


/*
 * Number of SPI instances this build has (the size of the leg table).
 * Pair with inst(i) to enumerate: for i in 0 .. instance_count()-1.
 */
uint8_t nora_spi_i2s_tdm_instance_count( void )
{
    return s_stream.leg_count;
}

/*
 * Return the handle for one SPI instance, or NULL if index is out of range.
 *
 * index is a dense logical leg index in table order (0 = primary leg). Physical spiN()
 * accessors below search the descriptor table and return the row that actually owns SPIn;
 * therefore their meaning remains literal even when a board maps logical legs 0/1 onto
 * physical SPI3/SPI4.
 */
nora_spi_i2s_tdm_inst_t* nora_spi_i2s_tdm_inst( uint8_t index )
{
    if( index >= (uint8_t)TDM_SPI_LEG_COUNT )
    {
        return NULL;
    }
    return &s_spi_legs[index];
}

static nora_spi_i2s_tdm_inst_t* tdm_find_physical_spi( tdm_spi_inst_t spi_inst )
{
    uint8_t i;

    for( i = 0u; i < s_stream.leg_count; i++ )
    {
        if( s_stream.legs[i].spi_inst == spi_inst )
        {
            return &s_stream.legs[i];
        }
    }
    return NULL;
}

nora_spi_i2s_tdm_inst_t* nora_spi_i2s_tdm_spi1( void )
{
    return tdm_find_physical_spi( TDM_SPI1 );
}

nora_spi_i2s_tdm_inst_t* nora_spi_i2s_tdm_spi2( void )
{
    return tdm_find_physical_spi( TDM_SPI2 );
}

nora_spi_i2s_tdm_inst_t* nora_spi_i2s_tdm_spi3( void )
{
    return tdm_find_physical_spi( TDM_SPI3 );
}

nora_spi_i2s_tdm_inst_t* nora_spi_i2s_tdm_spi4( void )
{
#if NORA_SPI_I2S_TDM_DSPIC33AK_DEVICE == NORA_SPI_I2S_TDM_DSPIC33AK_DEV_AK512
    return tdm_find_physical_spi( TDM_SPI4 );
#else
    return NULL;
#endif
}


//===========================================================
// Last-error diagnostic (debug aid; see the header contract). Plain last-writer-wins
// store -- NOT updated from the ISR hot path and NOT stream health.
//===========================================================
static volatile nora_spi_i2s_tdm_error_t s_last_error = NORA_SPI_I2S_TDM_ERR_NONE;

static inline void tdm_set_error( nora_spi_i2s_tdm_error_t err )
{
    s_last_error = err;
}

nora_spi_i2s_tdm_error_t nora_spi_i2s_tdm_get_last_error( void )
{
    return s_last_error;
}


/*
 * Return one instance's current writable TX ping-pong half, or NULL.
 *
 * For an app that produces one instance's output from ANOTHER instance's block callback
 * -- e.g. a co-clocked dual-codec demo where SPI1's callback fills BOTH its own and
 * SPI2's TX so the two codecs stay sample-aligned (same block, same frame), with no
 * cross-ISR handoff or ordering/race dependency. The returned half is the one NOT being
 * transmitted (same selection the instance's own block callback receives as dst). Only
 * valid while inst is running, and only meaningful when called at a block boundary --
 * co-clocked siblings share the ping-pong phase, so SPI2's writable half then matches
 * SPI1's. Returns NULL if inst is NULL/stopped or the half cannot be resolved; the
 * caller must NULL-check before writing.
 */
nora_tdm_slot_t* nora_spi_i2s_tdm_inst_tx_fill_ptr( nora_spi_i2s_tdm_inst_t* inst )
{
    nora_tdm_slot_t* dst = NULL;   // == int32_t* on this family; see nora_tdm_slot_t

    if( ( inst == NULL ) || !inst->running )
    {
        return NULL;
    }
    // Per-leg pong-half offset = slots * blk (runtime path; the hot ISR uses a literal).
    tdm_get_dest_ptr( nora_dma_read_src_hot( (nora_dma_channel_t)inst->tx_dma_ch ), inst->tx_buffer,
                      (uint32_t)inst->geom_slots_per_fs * inst->geom_block_frames, &dst );
    return dst;
}


