sulaolab/sonora-ak-nano/src/app/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ak.c
// Public SYSTEM-mode stop of every sync domain. Domain-level teardown counterpart to
// start_all_domains() so callers never enumerate individual logical legs. Rejects
// (false, HW unchanged) unless the stream was committed via configure_system() (mode==SYSTEM);
// a SINGLE-mode stream tears down through inst_stop(). Idempotent success otherwise.
bool nora_spi_i2s_tdm_stop_all_domains( void )
{
    if( s_config_mode != TDM_CONFIG_MODE_SYSTEM )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    tdm_stop_all_domains_impl();
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


// (Startup phase-lock verification is done per-block in the app's SPI1 block callback -- it must
// observe multiple conditions across consecutive blocks, incl. tail_tear which needs the callback's
// begin/end sampling. The HAL exposes the primitives inst_tx_active_half()/inst_tx_active_pos() and
// the mirror's NULL-when-unsafe; a HAL position-only "locked?" snapshot was intentionally NOT added
// because wdiff==0 alone is necessary-but-not-sufficient, as HW showed, wdiff=0 with tail_tear=samp.)



/*
 * Stop ONE instance and make its next start deterministic (MODE-AGNOSTIC implementation).
 *
 * SoftStop policy (per instance): does NOT stop DMACONbits.ON (shared controller) or
 * change PPS/CLC routing; stops only this instance's SPI module + DMA channels, masks
 * its DMA IRQs first so its ISR cannot refill mid-teardown, clears its pending
 * status, and clears its buffers so a restart is silent. Safe to call when stopped.
 *
 * This static core carries no mode/primary gate so the SYSTEM domain teardown
 * (stop_domain/stop_all_domains) can tear down every member leg. The public inst_stop()
 * below wraps it with the SINGLE-mode + primary-only gate.
 */
static void tdm_inst_stop_impl( tdm_spi_leg_t *inst )
{
    if( ( inst == NULL ) || !tdm_spi_leg_is_valid( inst ) )
    {
        return;
    }

    // Mark stopped up front so a per-instance running query sees the transition.
    inst->running = false;

    // DMA IRQs off + channels off first (no refill), then SPI module + triggers off.
    tdm_inst_soft_stop_dma( inst );
    nora_spi_i2s_tdm_hw_soft_stop( inst->spi_inst );

    // Release the CLC10 50%-FS generator if this instance owned it (disables the flip-flop;
    // PPS routes are left in place, like the rest of stop()). No-op if it didn't.
    nora_spi_i2s_tdm_fs_clc_release( inst->spi_inst );

    // Clear pending status/flags, then buffers, before the next start.
    tdm_inst_clear_dma_flags( inst );
    nora_spi_i2s_tdm_hw_irq_clear_flags( inst->spi_inst );
    tdm_inst_clear_buffers( inst );
}


/*
 * Public per-instance stop: SINGLE-mode + PRIMARY-only, symmetric with inst_start().
 *
 * Validation order matches inst_start(): a NULL/invalid handle is ERR_BAD_INSTANCE FIRST, then
 * the mode/primary gate. Rejected (false) when the stream was committed via configure_system()
 * (mode==SYSTEM -> tear down through stop_domain()/stop_all_domains() instead) or inst is not the
 * primary leg. Returns true after the teardown (or if the primary was already stopped -- idempotent).
 */
bool nora_spi_i2s_tdm_inst_stop( nora_spi_i2s_tdm_inst_t* inst )
{
    if( ( inst == NULL ) || !tdm_spi_leg_is_valid( inst ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    if( ( s_config_mode != TDM_CONFIG_MODE_SINGLE ) || !tdm_inst_is_primary( inst ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_CONFIG_MODE );
        return false;
    }
    tdm_inst_stop_impl( inst );
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * Mask/unmask ONE instance's RX-block interrupt without touching its stream.
 *
 * The DMA channel stays enabled, so TX keeps streaming and RX keeps filling; only the
 * RX-block ISR -- the per-block callback plus every diagnostic it maintains -- stops.
 * See the header for the single case this is for (a mirrored, RX-unread leg) and for
 * the caller's obligation not to read that leg's ISR counters while masked.
 *
 * Re-enable clears the pending flag first: DMA requests kept arriving while masked, so
 * an un-cleared flag would fire the ISR immediately with a stale half position.
 */
bool nora_spi_i2s_tdm_inst_set_block_irq_enabled( nora_spi_i2s_tdm_inst_t* inst,
                                                       bool enabled )
{
    if( ( inst == NULL ) || !tdm_spi_leg_is_valid( inst ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    if( enabled )
    {
        nora_dma_clear_irq_flag( inst->rx_dma_ch );
    }
    nora_dma_irq_enable( inst->rx_dma_ch, enabled );
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


bool nora_spi_i2s_tdm_inst_block_irq_is_enabled( const nora_spi_i2s_tdm_inst_t* inst )
{
    if( inst == NULL )
    {
        return false;
    }
    return nora_dma_irq_is_enabled( inst->rx_dma_ch );
}




/*
 * Snapshot ONE instance's ISR load monitor.
 *
 * Values are updated from that instance's RX-block ISR, so its RX DMA IE is briefly
 * masked while reading the 32-bit counters on the 16-bit core. Returns false (NULL
 * args), or until at least one timed event exists and the high-resolution timer was
 * initialized. clear_peak resets min/max/event afterward.
 */
bool nora_spi_i2s_tdm_inst_get_load( nora_spi_i2s_tdm_inst_t* inst,
                                          nora_spi_i2s_tdm_load_t* monitor,
                                          bool clear_peak )
{
    bool     rxie_bak;
    bool     valid;

    if( ( inst == NULL ) || ( monitor == NULL ) )
    {
        return false;
    }

    // The diag counters are updated in this instance's RX-block ISR; mask its IE so
    // the snapshot + clear are consistent against the 16-bit core's non-atomic 32-bit
    // reads. The diag module itself does no masking.
    //
    // COUNTS ONLY inside the mask. Masking this IE holds off the audio block ISR's ENTRY, and the
    // tick->us conversion is three 64-bit divisions on values already copied into the caller's own
    // struct -- there is nothing there to keep consistent. Scale after the restore.
    rxie_bak = tdm_rx_ie_disable( inst->rx_dma_ch );
    valid    = nora_spi_i2s_tdm_diag_get_load_counts( &inst->diag, monitor, clear_peak );
    tdm_rx_ie_restore( inst->rx_dma_ch, rxie_bak );

    nora_spi_i2s_tdm_diag_load_scale( monitor );

