sulaolab/sonora-ak-nano/src/app/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ak.c
    return valid;
}


/*
 * Snapshot ONE instance's health/status.
 *
 * block_count, block_deadline_miss_count, load, and running are THIS instance's.
 * active is engine-wide (the shared clock/source readiness gate).
 */
bool nora_spi_i2s_tdm_inst_get_status( nora_spi_i2s_tdm_inst_t* inst,
                                            nora_spi_i2s_tdm_status_t* status,
                                            bool clear_peak )
{
    bool     rxie_bak;

    if( ( inst == NULL ) || ( status == NULL ) )
    {
        return false;
    }

    status->active  = nora_spi_i2s_tdm_is_active();   // shared clock/source readiness gate
    status->running = inst->running;                       // this instance's running state

    // 32-bit reads on a 16-bit core are not atomic vs this instance's RX-block ISR; mask briefly.
    rxie_bak = tdm_rx_ie_disable( inst->rx_dma_ch );
    nora_spi_i2s_tdm_diag_read_counts( &inst->diag,
                                            &status->block_count,
                                            &status->block_deadline_miss_count );
    status->err_rov_block_count       = inst->diag.err_rov_block_count;   // masked read
    status->err_tur_block_count       = inst->diag.err_tur_block_count;
    status->err_frm_block_count       = inst->diag.err_frm_block_count;
    status->frmerr_consecutive_blocks = inst->diag.frmerr_consecutive_blocks;
    status->rx_dma_overrun_count      = inst->diag.rx_dma_overrun_count;
    status->rx_dma_other_irq_count    = inst->diag.rx_dma_other_irq_count;
    status->rx_dma_last_status        = inst->diag.rx_dma_last_status;
    tdm_rx_ie_restore( inst->rx_dma_ch, rxie_bak );

    // load monitor (does its own RX-IE guard; honours clear_peak)
    (void)nora_spi_i2s_tdm_inst_get_load( inst, &status->load, clear_peak );

    return true;
}


/*
 * Drop ONE instance's framed-transport error history. Masks this instance's RX-block ISR for the
 * writes, like every other public reader/writer of the diag block: the counters are 32-bit on a
 * 16-bit core, so a plain store races the ISR that increments them.
 */
bool nora_spi_i2s_tdm_inst_clear_error_counts( nora_spi_i2s_tdm_inst_t* inst )
{
    bool rxie_bak;

    if( inst == NULL )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }

    rxie_bak = tdm_rx_ie_disable( inst->rx_dma_ch );
    nora_spi_i2s_tdm_diag_clear_errflags( &inst->diag );
    tdm_rx_ie_restore( inst->rx_dma_ch, rxie_bak );

    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * Singleton form: the PRIMARY leg, same rule as the other singleton wrappers below.
 */
bool nora_spi_i2s_tdm_clear_error_counts( void )
{
    if( s_stream.primary_leg_index >= s_stream.leg_count )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    return nora_spi_i2s_tdm_inst_clear_error_counts(
        &s_stream.legs[s_stream.primary_leg_index] );
}


/*
 * Singleton load/status readers: report the PRIMARY leg (primary_leg_index, default logical leg 0).
 * Thin wrappers over the per-instance readers; behaviour is unchanged from before the
 * per-instance API was added. They go through s_stream.legs (the stream is the single
 * source for the leg table, same as is_running()/is_active()) rather than s_spi_legs
 * directly, and use a mutable leg because the per-instance readers honour clear_peak. Guard
 * the index (fail closed -> false) so an out-of-range primary never dereferences the table.
 */
bool nora_spi_i2s_tdm_get_load( nora_spi_i2s_tdm_load_t* monitor, bool clear_peak )
{
    if( s_stream.primary_leg_index >= s_stream.leg_count )
    {
        return false;
    }
    return nora_spi_i2s_tdm_inst_get_load( &s_stream.legs[s_stream.primary_leg_index], monitor, clear_peak );
}

/*
 * Rate-monotonic leg priorities. See the header for what this is for and what it implies.
 *
 * Every configured leg is put back on the base priority first, so the result does not depend
 * on what a previous call did, and only then is the long-deadline leg lowered. The base is
 * PRIO_TDM_DMA, which is also what hw.c programs at configure() time -- one definition.
 */
bool nora_spi_i2s_tdm_set_rate_monotonic_priorities( nora_spi_i2s_tdm_inst_t* shorter_deadline,
                                                     nora_spi_i2s_tdm_inst_t* longer_deadline )
{
    uint8_t i;

    if( shorter_deadline == NULL )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }
    /* base-1 must still be a real interrupt priority (0 means disabled). */
    if( (uint8_t)PRIO_TDM_DMA < 2u )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_ARGUMENT );
        return false;
    }

    /* Record the intent on each leg FIRST, then push it to IPCx. tdm_inst_arm() re-applies
     * leg->irq_priority on every start, so the map survives a whole-transport restart -- which
     * it did NOT before 2026-08-26 (the channel config carried the PRIO_TDM_DMA constant, so
     * arming reverted every leg to the base and only the non-arming fast rate-change path kept
     * the asymmetry). Task level is still the only writer of both the field and IPCx. */
    for( i = 0u; i < s_stream.leg_count; i++ )
    {
        s_stream.legs[i].irq_priority = (uint8_t)PRIO_TDM_DMA;
        nora_dma_irq_set_priority( s_stream.legs[i].rx_dma_ch, (uint8_t)PRIO_TDM_DMA );
    }

    if( ( longer_deadline != NULL ) && ( longer_deadline != shorter_deadline ) )
    {
        longer_deadline->irq_priority = (uint8_t)( (uint8_t)PRIO_TDM_DMA - 1u );
        nora_dma_irq_set_priority( longer_deadline->rx_dma_ch,
                                   longer_deadline->irq_priority );
    }
    return true;
}

uint8_t nora_spi_i2s_tdm_inst_irq_priority( const nora_spi_i2s_tdm_inst_t* inst )
{
    if( inst == NULL )
    {
        return 0u;
    }
    return nora_dma_irq_get_priority( inst->rx_dma_ch );
}

bool nora_spi_i2s_tdm_get_status( nora_spi_i2s_tdm_status_t* status, bool clear_peak )
{
    if( s_stream.primary_leg_index >= s_stream.leg_count )
    {
        return false;
    }
    return nora_spi_i2s_tdm_inst_get_status( &s_stream.legs[s_stream.primary_leg_index], status, clear_peak );
}




//===========================================================
// DMA INTERRUPT VECTORS  --  IMPORTANT: these ARE the IVT entries the CPU jumps to.
//
// The HAL ships its own DMA interrupt vectors so the transport is turnkey: link the HAL
// and the _DMAnInterrupt slots are filled, the DMA channels are already armed by
// start(), and the integrator only registers a per-instance block callback. (Previously
// these lived in a separate optional TU nora_spi_i2s_tdm_irq.c + a forwarding
// worker; folded back here -- no cross-TU hop -- since the toolchain/IVT coupling is
// confined to this one section.)
//
// One explicit RX vector per leg. Each RX vector runs that leg's block ISR (tdm_rx_block
// with THIS leg + its RX/TX channels + its slots*blk half size, ALL compile-time
// constants so the DMA register access / pointer math fold, with NO runtime channel->leg
// lookup). The TX channel is INTENTIONALLY interrupt-less (hw.c enables the CPU IRQ on the
// RX channel only): TX is fire-and-forget ping-pong with auto-reload, so RX completion
// alone defines the block boundary -- there is no TX ISR.
//
// The vector NAME (_DMA<n>Interrupt) encodes the DMA channel, so each vector is bound to
// its conf.h RX-DMA channel by a compile-time assert: at the default mapping this defines
//     _DMA0Interrupt   (leg SPI1 RX, DMA0)
//     _DMA2Interrupt   (leg SPI2 RX, DMA2, when NORA_TDM_USE_SPI2)
// Change an RX-DMA channel macro in conf.h and the build FAILS (assert) until the vector
// name + its assert are updated to match. IVT slots are chip-wide exclusive; a genuine
// clash surfaces as a duplicate-_DMAnInterrupt link error.
//===========================================================

// One RX interrupt vector per leg. tdm_rx_block is static inline (same TU) so
// the constant RX/TX channels + half size fold into the register access. (tx) is still
// passed -- tdm_rx_block reads the TX channel's DMA address to pick the writable TX half
// -- but the TX channel itself raises no interrupt (interrupt-less; see above).
//
// Compiled only when the HAL owns the IVT (NORA_TDM_DEFINE_DMA_VECTORS=1, default).
// With =0 the integrator owns the vectors and calls nora_spi_i2s_tdm_inst_rx_isr()
// (below) from their own _DMA<rx>Interrupt instead.
#if NORA_TDM_DEFINE_DMA_VECTORS
/*
 * ISR PROLOGUE PUSHES: WHY EACH VECTOR CALLS A noinline BODY INSTEAD OF INLINING DIRECTLY.
 *
 * `context` banks W0-W7 only (DS70005591D: seven alternate W0-W7 arrays plus AccA/AccB/
 * RCOUNT and the DSP CORCON bits, each inherently tied to an IPL).  W8-W14 are NOT banked,
 * so when the always_inline tdm_rx_block body needs W8 the compiler must save it -- and it
 * emitted `mov.l w8,[w15++]` as the vector's VERY FIRST instruction.  Measured on an
 * AK512 bidirectional ASRC configuration: __DMA0Interrupt and __DMA2Interrupt each
 * carried 2 such pushes at +0, the only live ISRs besides __QEI2Interrupt (a deliberate
 * trap-reproduction harness) and __DefaultInterrupt that still did.
 *
 * That is the exact shape the A1 silicon STACK ERROR keys on -- see the DO-NOT-REVERT note
 * in the application-level ASRC clock control, where a controlled A/B
 * showed 6 prologue pushes trapping at stress cycle 16 and zero pushes surviving 70.
 * `context` cannot remove these ones: the registers really are outside the bank.
 *
 * So move them one call deep instead.  The vector becomes `rcall <body> / retfie` with no
 * prologue push, and the unavoidable W8 save happens inside an ordinary function where it
 * is not an ISR prologue.  Precedent: the load-profiler hook on the CCP vectors had to
 * become an out-of-line real function for the same reason.
 *
 * THE FOLDING IS PRESERVED, WHICH IS THE WHOLE POINT.  The body is per-vector and its
 * channel numbers and half size are still literals, so tdm_rx_block still folds them into
 * the register access with no runtime channel->leg lookup.  This is NOT the regression the
 * always_inline note above warns about: that one was ONE SHARED out-of-line _tdm_rx_block
 * reached by every vector, which is what loses the folding.  Cost here is one rcall+return
 * per RX block -- 3 kHz per leg at 48 kHz/block-16, so under 0.05% of the CPU -- and the
 * ~1.1 KB of per-vector body duplication that always_inline was already paying for.
 *
 * Verify after touching this: the vectors must show ZERO `mov.l wN,[w15++]`.
 *   xc-dsc-objdump -d --mdfp=<DFP>/xc16 <elf> | grep -A4 '<__DMA0Interrupt>:'
 * tools/asrc/hotpath_invariance.py still guards the folding itself.
 */
/*
 * A1-SILICON GATE for the ISR-prologue workaround below.
 *
 * `context` is NOT gated and must not be: the alternate W0-W7 array is inherently tied to
 * the IPL on this core (DS70005591D), so declaring it is a statement of hardware fact that
 * is correct on every revision. What IS revision-specific is the extra indirection that
 * moves the W8+ saves OUT of the vector prologue, because its only purpose is to avoid the
 * A1 STACK ERROR trigger and it costs one rcall + return per interrupt.
 *
 * Default 1 = keep the workaround. Set to 0 (-D APP_A1_ISR_STACK_WORKAROUND=0) to build the
 * direct form and A/B it -- which is how this should be re-evaluated on A2 silicon, where
 * the exit condition for the whole A1 STACK ERROR investigation already lives. The die
 * revision is a RUNTIME fact (app_silicon.c prints it in the boot banner), so this cannot
 * key off it automatically; it is a deliberate build choice.
 *
 * Rationale and measurements: the ISR W15 prologue-push audit, and the DO-NOT-REVERT
 * note in the application-level ASRC clock control.
 */
#ifndef APP_A1_ISR_STACK_WORKAROUND
#define APP_A1_ISR_STACK_WORKAROUND (1)
#endif

#if APP_A1_ISR_STACK_WORKAROUND
#define TDM_DEFINE_RX_VECTOR( vec, leg, rxdma, txdma )                                static void __attribute__((noinline)) vec##_body( void )                          {                                                                                     tdm_rx_block( &s_spi_legs[leg], rxdma, txdma,                                                   TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS,                                                            NORA_TDM_BLOCK_FRAMES) );                    }                                                                                 void __attribute__((interrupt, context)) vec( void ) { vec##_body(); }
#else
/* Direct form: body inlined into the vector. Fewer instructions and no rcall, but the
 * W8 save lands in the vector prologue -- the A1 trigger. For A2 comparison only. */
#define TDM_DEFINE_RX_VECTOR( vec, leg, rxdma, txdma )                                void __attribute__((interrupt, context)) vec( void )                              {                                                                                     tdm_rx_block( &s_spi_legs[leg], rxdma, txdma,                                                   TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS,                                                            NORA_TDM_BLOCK_FRAMES) );                    }
#endif

// Explicit HAL-owned RX vectors (was X-macro-generated). tdm_rx_block is same-TU static inline, so
// the literal channel numbers + half size fold into the register access -- NO runtime channel->leg
// lookup. The vector NAME encodes the DMA channel number, so bind each name to its conf.h channel
// with a compile-time assert: change the RX-DMA channel macro and the build FAILS until the vector
// name (and its assert) is updated to match. (tx) is passed so tdm_rx_block can pick the writable TX
// half; the TX channel raises no interrupt.
#if NORA_TDM_BASE_ON_SPI34
TDM_COMPILEASSERT( NORA_TDM_SPI3_RX_DMA == 4 );   /* logical A -> _DMA4Interrupt */
TDM_DEFINE_RX_VECTOR( _DMA4Interrupt, TDM_SPI_LEG_SPI1,
                       NORA_TDM_SPI3_RX_DMA, NORA_TDM_SPI3_TX_DMA )
#else
TDM_COMPILEASSERT( NORA_TDM_SPI1_RX_DMA == 0 );   /* _DMA0Interrupt binding */
TDM_DEFINE_RX_VECTOR( _DMA0Interrupt, TDM_SPI_LEG_SPI1,
                       NORA_TDM_SPI1_RX_DMA, NORA_TDM_SPI1_TX_DMA )
#endif
#if NORA_TDM_USE_SPI2
#if NORA_TDM_BASE_ON_SPI34
TDM_COMPILEASSERT( NORA_TDM_SPI4_RX_DMA == 6 );   /* logical B -> _DMA6Interrupt */
TDM_DEFINE_RX_VECTOR( _DMA6Interrupt, TDM_SPI_LEG_SPI2,
                       NORA_TDM_SPI4_RX_DMA, NORA_TDM_SPI4_TX_DMA )
#else
TDM_COMPILEASSERT( NORA_TDM_SPI2_RX_DMA == 2 );   /* _DMA2Interrupt binding */
TDM_DEFINE_RX_VECTOR( _DMA2Interrupt, TDM_SPI_LEG_SPI2,
                       NORA_TDM_SPI2_RX_DMA, NORA_TDM_SPI2_TX_DMA )
#endif
#endif // NORA_TDM_USE_SPI2
#if NORA_TDM_USE_SPI3 && !NORA_TDM_BASE_ON_SPI34
TDM_COMPILEASSERT( NORA_TDM_SPI3_RX_DMA == 4 );   /* _DMA4Interrupt binding */
TDM_DEFINE_RX_VECTOR( _DMA4Interrupt, TDM_SPI_LEG_SPI3,
                       NORA_TDM_SPI3_RX_DMA, NORA_TDM_SPI3_TX_DMA )
#endif // NORA_TDM_USE_SPI3
#if NORA_TDM_USE_SPI4 && !NORA_TDM_BASE_ON_SPI34
TDM_COMPILEASSERT( NORA_TDM_SPI4_RX_DMA == 6 );   /* _DMA6Interrupt binding */
TDM_DEFINE_RX_VECTOR( _DMA6Interrupt, TDM_SPI_LEG_SPI4,
                       NORA_TDM_SPI4_RX_DMA, NORA_TDM_SPI4_TX_DMA )
#endif // NORA_TDM_USE_SPI4
#endif // NORA_TDM_DEFINE_DMA_VECTORS

