sulaolab/sonora-ak-nano/src/app/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ak.c
/*
 * Build the hardware-applied config for one SPI leg.
 *
 * Just a validated copy of the leg's stored config -- each leg carries its OWN clock
 * role (master/slave), so there is no stream-wide role override here. A follower is
 * SLAVE because the integrator configured it SLAVE (it rides the shared clock), not
 * because the HAL forces it; an instance on an independent clock can be its own master.
 */
static bool tdm_spi_leg_get_effective_config( const tdm_spi_leg_t *leg,
                                              nora_spi_i2s_tdm_config_t *effective_cfg )
{
    if( ( effective_cfg == NULL ) || !tdm_spi_leg_is_valid( leg ) || !leg->config_valid )
    {
        return false;
    }

    *effective_cfg = leg->config;
    return true;
}








// Deadline-miss, ISR load/time, and the debug scope-GPIO/printf instrumentation
// that used to live here (local_dma_debug_check / _start / _end) now live in the
// separated diagnostics module (nora_spi_i2s_tdm_diag.*), reached through
// nora_spi_i2s_tdm_diag_check_deadline / _isr_begin / _isr_end.









/*
 * Resolve the RX ping-pong half completed by the DMA status snapshot.
 *
 * Output is NULL when the status does not identify a usable half or when inputs
 * are invalid. The returned pointer is into the HAL-owned RX buffer and is passed
 * read-only to the application block callback.
 */
static inline void tdm_get_src_ptr( uint32_t             dma_stat,
                                      const int32_t* const pRxDat,
                                      uint32_t             half_pos,
                                      const int32_t**      src_pptr )
{
    if( src_pptr == NULL )
    {
        return;
    }
    *src_pptr = NULL;

    if( pRxDat == NULL )
    {
        return;
    }

    // half_pos = this instance's ping/pong half size in words (slots * blk).
    switch( nora_dma_half_from_status( dma_stat ) )
    {
    case NORA_DMA_HALF_FIRST:
        // SW can use Ping(A) side buffer.
        //////////////////////////////////////
        *src_pptr  = &pRxDat[ DMA_BUF_PING_POS ];
        break;

    case NORA_DMA_HALF_SECOND:
        // SW can use Pong(B) side buffer.
        //////////////////////////////////////
        *src_pptr  = &pRxDat[ half_pos ];
        break;

    default:
        break;
    }
}

/*
 * Resolve the TX ping-pong half that software may safely fill next.
 *
 * The active DMA source address tells which half DMA is currently reading; the
 * helper returns the opposite half. Output is NULL when inputs are invalid.
 */
static inline void tdm_get_dest_ptr( uint32_t       dma_tx_addr,
                                       int32_t* const pTxDat,
                                       uint32_t       half_pos,
                                       int32_t**      dest_pptr )
{
    if( dest_pptr == NULL )
    {
        return;
    }
    *dest_pptr = NULL;

    if( pTxDat == NULL )
    {
        return;
    }

    // half_pos = this instance's ping/pong half size in words (slots * blk). The buffer
    // is [base, end) = pTxDat[0 .. 2*half_pos); the pong half starts at pTxDat[half_pos].
    // GUARD: the active TX-DMA source address must actually lie inside this buffer. At a
    // reload boundary, just after stop, on the first block, or in a fault, DMAxSRC can
    // hold an out-of-range value -- a bare ">= mid" test would then misclassify the half
    // and hand back a pointer to the half DMA is transmitting. Out of range -> NULL (the
    // caller NULL-checks and skips this block's fill).
    const uintptr_t base = (uintptr_t)&pTxDat[ DMA_BUF_PING_POS ];
    const uintptr_t mid  = (uintptr_t)&pTxDat[ half_pos ];
    const uintptr_t end  = (uintptr_t)&pTxDat[ 2u * half_pos ];
    const uintptr_t addr = (uintptr_t)dma_tx_addr;   // DMAxSRC snapshot as an address

    if( ( addr < base ) || ( addr >= end ) )
    {
        return;   // *dest_pptr stays NULL
    }

    if( addr >= mid )
    {
        // DMA is reading the Pong half -> SW fills Ping
        *dest_pptr = (int32_t*)&pTxDat[ DMA_BUF_PING_POS ];
    }
    else
    {
        // DMA is reading the Ping half -> SW fills Pong
        *dest_pptr = (int32_t*)&pTxDat[ half_pos ];
    }
}


/*
 * Validate the configuration envelope for ONE instance.
 *
 * The HAL accepts only what it can actually program/size: 32-bit words; geometry
 * (slots_per_fs / block_frames) that MATCHES this leg's compile-time buffer geometry
 * (its Rx_<name>/Tx_<name> are sized for exactly that, per the leg table); an
 * explicit role; and a framing the FRMCNT path supports -- I2S with 2 slots, or TDM
 * with 4/8/16/32 slots. This keeps configure() from programming untested framing or a
 * geometry the static buffers were not sized for.
 */
static bool tdm_config_is_supported( const tdm_spi_leg_t* leg, const nora_spi_i2s_tdm_config_t* cfg )
{
    if( ( cfg == NULL ) || ( leg == NULL ) )  return false;

    if( cfg->word_bits != 32u )         return false;
    // Geometry must match THIS leg's compile-time (statically allocated) geometry.
    if( cfg->slots_per_fs != leg->geom_slots_per_fs ) return false;
    if( cfg->block_frames != leg->geom_block_frames ) return false;

    // role must be an explicit SLAVE or MASTER -- otherwise a garbage value would be
    // silently treated as SLAVE everywhere (role == MASTER ? ... : SLAVE).
    if( ( cfg->clock_role != NORA_SPI_I2S_TDM_CLOCK_SLAVE ) &&
        ( cfg->clock_role != NORA_SPI_I2S_TDM_CLOCK_MASTER ) )
    {
        return false;
    }

    if( cfg->format == NORA_SPI_I2S_TDM_FORMAT_I2S )
    {
        if( cfg->slots_per_fs != 2u )   return false;        // I2S = 2 slots (L/R)
    }
    else if( cfg->format == NORA_SPI_I2S_TDM_FORMAT_TDM )
    {
        // TDM: FRMCNT supports FS every 4/8/16/32 words.
        if( ( cfg->slots_per_fs != 4u ) && ( cfg->slots_per_fs != 8u ) &&
            ( cfg->slots_per_fs != 16u ) && ( cfg->slots_per_fs != 32u ) )
        {
            return false;
        }
    }
    else
    {
        return false;
    }

    // fs_shape must be a known value -- otherwise a garbage value would be silently
    // treated as FS_PULSE by hw_apply_config (shape == FS_50PCT ? ... : ...).
    if( ( cfg->fs_shape != NORA_SPI_I2S_TDM_FS_PULSE ) &&
        ( cfg->fs_shape != NORA_SPI_I2S_TDM_FS_50PCT ) )
    {
        return false;
    }
    // No role/format restriction on fs_shape. A TDM SLAVE receives FS as an INPUT, so
    // fs_shape is accepted but has no generated-waveform effect (hw_apply_config treats a
    // slave as normal framing). TDM FS_50PCT is generated by CLC10 only in MASTER mode.

    // Note: sample rate is NOT part of the transport envelope -- the core is
    // rate-agnostic (runs at the configured BRG / external clock). The product's
    // supported-rate policy lives in the app layer (APP_SAMPLE_RATE_IS_SUPPORTED), not here.
    return true;
}


