sulaolab/sonora-ak-nano/src/app/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ak.c
/*
 * Read-and-clear / restore the CPU interrupt enable of an instance's RX DMA channel.
 *
 * Used to bracket non-atomic updates against the instance's RX-block ISR. Channel-
 * generic (via the DMA HAL), so it follows whatever DMA channel an instance is mapped
 * to in conf.h -- no per-channel hardcode. Returns the prior IE state; restore re-arms
 * only if it was enabled (so masking before start() leaves the IE off).
 */
static inline bool tdm_rx_ie_disable( uint8_t rx_dma_ch )
{
    return nora_dma_irq_disable_save_hot( (nora_dma_channel_t)rx_dma_ch );
}

static inline void tdm_rx_ie_restore( uint8_t rx_dma_ch, bool was_enabled )
{
    nora_dma_irq_restore_hot( (nora_dma_channel_t)rx_dma_ch, was_enabled );
}


/*
 * One SPI instance's RX-block ISR body (generic).
 *
 * Snapshots the instance's RX DMA status, maps the just-completed RX half and the
 * writable TX half of THIS instance, then invokes THIS instance's callback with
 * (src, dst, user). Called from the explicit per-instance RX vector (the
 * _DMA<rx>Interrupt section above), which passes this instance's leg + channels.
 *
 * rx_ch / tx_ch are passed as compile-time constants from the vector so the DMA
 * register access (isr_snapshot / read_src) folds to direct register reads -- do NOT
 * call this with a runtime channel value. half_pos (= this instance's slots*blk) is
 * likewise a compile-time literal so the ping/pong pointer math stays folded.
 */
// always_inline: see the forward declaration for why this is required and not advisory.
static inline __attribute__((always_inline)) void tdm_rx_block(
    tdm_spi_leg_t* inst, uint8_t rx_ch, uint8_t tx_ch, uint32_t half_pos )
{
    nora_dma_status_t dma_stat;
    const int32_t*  src_ptr = NULL;
          int32_t*  dst_ptr = NULL;

    // Fixed-window CPU-load hook. Takes ownership of the CPU for THIS leg, and returns the token
    // that hands it back at every exit below. Unlike the TDMsum union hook it replaced, this
    // measures EXCLUSIVE time: a higher-priority vector that preempts this block moves that time
    // out of this leg's total and into its own, so the reading no longer depends on whether the
    // rate-monotonic priority map has demoted this leg below the other one.
    //
    // The token is a plain local, so it lives in this ISR's own frame/register and the nesting
    // record cannot be corrupted by a preemption. It must reach _exit on EVERY return path --
    // the two early returns below carry it. No availability test is needed: the profiler is
    // inert until configured, and its hooks are empty when NORA_CPU_LOAD_PROF is 0.
    nora_cpu_load_prof_enter( inst->prof_owner );

    nora_spi_i2s_tdm_diag_isr_begin( &inst->diag );

    // Sample + fold this instance's SPIxSTAT framed-transport health flags (SPIROV/SPITUR/
    // FRMERR) into its diag. Cheap (1 SFR read + masked ack); normally zero. The HAL only
    // records these counters -- recovery policy, if any, belongs to the application.
    nora_spi_i2s_tdm_diag_note_errflags( &inst->diag,
        nora_spi_i2s_tdm_hw_sample_ack_errflags( inst->spi_inst ) );

    dma_stat = nora_dma_isr_snapshot_hot( (nora_dma_channel_t)rx_ch );

    // Preserve DMAxSTAT before HALF/DONE resolution. In particular, an OVERRUN-only
    // snapshot has no completed half and will return below; its root-cause evidence must
    // survive that early exit in the public diagnostics.
    nora_spi_i2s_tdm_diag_note_dma_status( &inst->diag, dma_stat );

    // Stream-health check; diagnostic print is debug-only. Each instance counts its
    // own deadline misses in its own diag (no shared/master counter).
    nora_spi_i2s_tdm_diag_check_deadline_hot( &inst->diag,
                                                   rx_ch,
                                                   dma_stat );

    // Map this instance's completed RX half (callback input) and the TX half it may
    // fill (callback output). Each instance handles only its own RX/TX -- no dst_b.
    tdm_get_src_ptr( dma_stat, inst->rx_buffer, half_pos, &src_ptr );
    if( src_ptr == NULL )
    {
        nora_spi_i2s_tdm_diag_isr_end( &inst->diag );
        nora_cpu_load_prof_exit();
        return;
    }
    tdm_get_dest_ptr( nora_dma_read_src_hot( (nora_dma_channel_t)tx_ch ), inst->tx_buffer, half_pos, &dst_ptr );
    if( dst_ptr == NULL )
    {
        // TX-DMA source is out of the buffer envelope (reload boundary / just-stopped /
        // first block / fault): there is no writable TX half this block. Skip rather than
        // hand the callback a NULL dst -- the public contract is that dst is always valid
        // when block_cb runs. (Mirrors the src_ptr guard above.)
        nora_spi_i2s_tdm_diag_isr_end( &inst->diag );
        nora_cpu_load_prof_exit();
        return;
    }

    nora_spi_i2s_tdm_diag_note_block( &inst->diag );   // one completed block (read via get_status)

    // Deliver the completed block through this instance's registered callback. The
    // callee owns its DSP work buffers; the driver passes only this instance's
    // selected RX/TX ping-pong halves (both guaranteed non-NULL here). No callback ->
    // no app/DSP path: start() zeroes the TX half so a fresh start is silent until a
    // callback fills it (clearing the callback mid-stream leaves the last TX data looping).
    if( inst->block_cb != NULL )
    {
        inst->block_cb( src_ptr, dst_ptr, inst->block_user );
    }

    nora_spi_i2s_tdm_diag_isr_end( &inst->diag );
    nora_cpu_load_prof_exit();
}


// The application audio/DSP path lives above the HAL. The HAL core does NOT call any
// application function: each instance's RX-block handler delivers its block to the registered
// block callback only (no app fallback). The HAL core owns its DMA ping-pong buffers; the
// application owns its own processing buffers.
